Autodesk.Revit.ApplicationServices.Application.DocumentReloadedLatest
Subscribe to the DocumentReloadedLatestEventArgs event to be notified immediately after Revit has finished reloading a document with central model.
Remarks:
This event is raised immediately after Revit has finished reloading latest changes from a central model.
It is raised even when document reloading latest changes from a central model failed or was cancelled (during DocumentReloadingLatest event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of reloading latest changes from a central model has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2021

Autodesk.Revit.ApplicationServices.Application.DocumentReloadingLatest
Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model.
Remarks:
This event is raised when Revit is just about to reload latest changes from a central model.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentReloadingLatest event will be raised immediately after latest changes reloading from a central model
is finished.
Since:
2021

Autodesk.Revit.ApplicationServices.Application.ElementTypeDuplicated
Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type.
Remarks:
This event is raised immediately after Revit has finished duplicating an element type.
It is raised even when duplicating an element type failed or was cancelled (during ElementTypeDuplicating event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in the event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of duplicating an element type has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2015

Autodesk.Revit.ApplicationServices.Application.ElementTypeDuplicating
Subscribe to the ElementTypeDuplicating event to be notified when Revit is just about to duplicate an element type.
Remarks:
This event is raised when Revit is just about to duplicate an element type.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Import()Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.ElementTypeDuplicated event will be raised immediately after duplicating an element type is finished.
Since:
2015

Autodesk.Revit.ApplicationServices.Application.FamilyLoadedIntoDocument
Subscribe to the FamilyLoadedInto event to be notified after Revit loaded a family into a document.
Remarks:
This event is raised immediately after Revit has finished loading a family into a document.
It is raised even when family loading failed or was cancelled (during FamilyLoadingIntoDocument event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of importing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2015

Autodesk.Revit.ApplicationServices.Application.FamilyLoadingIntoDocument
Subscribe to the FamilyLoadingInto event to be notified when Revit is just about to load a family into a document.
Remarks:
This event is raised when Revit is just about to load a family into a document.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Import()Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.FamilyLoadedIntoDocument event will be raised immediately after family loading
is finished.
Since:
2015

Autodesk.Revit.ApplicationServices.Application.DocumentSynchronizedWithCentral
Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model.
Remarks:
This event is raised immediately after Revit has finished synchronizing a document with central model.
It is raised even when document synchronizing with central model failed or was cancelled (during DocumentSynchronizingWithCentral event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of synchronizing a document with central model has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentSynchronizingWithCentral
Subscribe to the DocumentSynchronizingWithCentral event to be notified when Revit is just about to synchronize a document with central model.
Remarks:
This event is raised when Revit is just about to synchronize a document with central model.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentSynchronizedWithCentral event will be raised immediately after document synchronizing with central model
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentOpened
Subscribe to the DocumentOpened event to be notified immediately after Revit has finished opening a document.
Remarks:
This event is raised immediately after Revit has finished opening a document.
It is raised even when document opening failed or was cancelled (during DocumentOpening event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of opening document has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.ViewsExportedByContext
Subscribe to the ViewsExportedByContext event to be notified immediately after Revit has finished exporting one or more views of the document via an export context by CustomExporter.
Remarks:
This event is raised immediately after Revit has finished exporting views of the document via an export context by CustomExporter.
It is raised even when view exporting via export context by CustomExporter failed.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view exporting by CustomExporter has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2021

Autodesk.Revit.ApplicationServices.Application.ViewsExportingByContext
Subscribe to the ViewsExportingByContext event to be notified when Revit is just about to export one or more views of the document via an export context by CustomExporter.
Remarks:
This event is raised when Revit is just about to export views of the document via an export context by CustomExporter.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.ViewsExportedByContext will be raised immediately after view exporting by CustomExporter
is finished.
Since:
2021

Autodesk.Revit.ApplicationServices.Application.ViewExported
Subscribe to the ViewExported event to be notified immediately after Revit has finished exporting a view of the document.
Remarks:
This event is raised immediately after Revit has finished exporting a view of the document.
It is raised only during accelerated export jobs, in which views are exported in parallel using a background process.
Accelerated export only occurs when exporting to DWF formats and not combining views into a single file.
It is raised even when view exporting failed.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view exporting has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2018

Autodesk.Revit.ApplicationServices.Application.ViewExporting
Subscribe to the ViewExporting event to be notified when Revit is just about to export a view of the document.
Remarks:
This event is raised when Revit is just about to export a view of the document.
It is raised only during accelerated export jobs, in which views are exported in parallel using a background process.
Accelerated export only occurs when exporting to DWF formats and not combining views into a single file.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk.Revit.DB.Document.Print()Autodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.ViewExported will be raised immediately after view exporting
is finished.
Since:
2018

Autodesk.Revit.ApplicationServices.Application.FileExported
Subscribe to the FileExported event to be notified immediately after Revit has finished exporting files of formats supported by the API.
Remarks:
This event is raised immediately after Revit has finished exporting files of formats supported by the API.
It is raised even when file exporting failed or was cancelled (during FileExporting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
If export is a part of 'Publish to Buzzsaw' command which consists of two parts – export of a document followed by publishing it to a BuzzSaw server, the event status only reflects the result of the Export action. The publishing part of the command could still be cancelled or could fail after FileExported event is raised.
This event is not cancellable, for the process of exporting file has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.FileExporting
Subscribe to the FileExporting event to be notified when Revit is just about to export files of formats supported by the API.
Remarks:
This event is raised when Revit is just about to export files of formats supported by the API.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk.Revit.Document.Print()Autodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.FileExported event will be raised immediately after file exporting
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.FileImported
Subscribe to the FileImported event to be notified immediately after Revit has finished importing a file of format supported by the API.
Remarks:
This event is raised immediately after Revit has finished importing a file of format supported by the API.
It is raised even when file importing failed or was cancelled (during FileImporting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of importing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.FileImporting
Subscribe to the FileImporting event to be notified when Revit is just about to import a file of format supported by the API.
Remarks:
This event is raised when Revit is just about to import a file of format supported by the API.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Import()Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.FileImported event will be raised immediately after file importing
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentCreated
Subscribe to the DocumentCreated event to be notified immediately after Revit has finished creating a new document.
Remarks:
This event is raised immediately after Revit has finished creating a new document.
It is raised even when document creation failed or was cancelled (during DocumentCreating event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of document creation has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentClosing
Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
Remarks:
This event is raised when Revit is just about to close a document.
This event is cancellable, except when it is raised as part of application closing.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to True to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document may not be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
An Autodesk.Revit.ApplicationServices.Application.DocumentClosed event will be raised immediately after document is closed.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.ViewPrinted
Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
Remarks:
This event is raised immediately after Revit has finished printing a view of the document.
If multiple views are combined to a single file, this event will be raised only once.
It is raised even when view printing failed.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view printing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.ViewPrinting
Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
Remarks:
This event is raised when Revit is just about to print a view of the document.
If multiple views are combined to a single file, this event will be raised only once.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk.Revit.DB.Document.Print()Autodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.ViewPrinted will be raised immediately after view printing
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentPrinted
Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
Remarks:
This event is raised immediately after Revit has finished printing a view or ViewSet of the document.
It is raised even when document printing failed or was cancelled (during DocumentPriting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of printing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentPrinting
Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
Remarks:
This event is raised when Revit is just about to print a view or ViewSet of the document.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk::Revit::DB::Document::PrintAutodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
After this event, for each view being printed, Autodesk.Revit.ApplicationServices.Application.ViewPrinting and Autodesk.Revit.ApplicationServices.Application.ViewPrinted events will be raised.
Another event Autodesk::Revit::DB::Document::DocumentPrinted will be raised immediately after document printing
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentSavedAs
Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
Remarks:
This event is raised immediately after Revit has finished saving document with a new file name.
Note that the first save of a newly created document  will raise DocumentSavedAs rather than Autodesk.Revit.ApplicationServices.Application.DocumentSaved event.
It is raised even when document saving failed or was cancelled (during DocumentSavingAs event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' property in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of saving document has already been finished.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentSavingAs
Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
Remarks:
This event is raised when Revit is just about to save the document with a new file name.
Note that the first save of a newly created document  will raise DocumentSavingAs rather than Autodesk.Revit.ApplicationServices.Application.DocumentSaving event.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.DocumentSavedAs will be raised immediately after the document has been saved with a new file name.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentSaved
Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
Remarks:
This event is raised immediately after Revit has finished saving a document.
Note that the first save of a newly created document  will raise Autodesk.Revit.ApplicationServices.Application.DocumentSavedAs
rather than the DocumentSaved event.
It is raised even when document saving failed or was cancelled (during DocumentSaving event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' property in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of saving document has already been finished.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.DocumentSaving
Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
Remarks:
This event is raised when Revit is just about to save the document.
Note that the first save of a newly created document will raise Autodesk.Revit.ApplicationServices.Application.DocumentSavingAs
rather than the DocumentSaving event.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk::Revit::DB::Document::Close() and similar overloads.Autodesk::Revit::DB::Document::Save() .Autodesk::Revit::DB::Document::SaveAs(String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.DocumentSaved will be raised immediately after the document has been saved.
Since:
2010

Autodesk.Revit.ApplicationServices.Application.ValidateUserConfigurationSettings(System.Boolean)
Validates and attempts to repair, if invalid, the current user configuration file.
Remarks:
User configuration files are optional settings for things like Dialog positioning etc.
The file is non-existent until configs get saved etc. and have been prone to corruption.
Given the optional nature of the file, if the user configuration is found to be in a corrupt state, an informational
crumb is journaled and the user configuration reset to a valid state to avoid issues accessing the settings. Pass true if
you wish to get an exception if the reset of a failed reset, false will just ignore the reset failure. In either case, the
processing of the throw etc. is done after the information is journaled.
bThrowOnFailedReset: true if attempt to reset a corrupt configuration should throw, false to ignore failure to reset.
Throws System::Configuration::ConfigurationErrorsException:
A corrupt configuration detected and failed to reset.